{
  "header": {
    "home": "Home",
    "aboutMe": "About Me",
    "resume": "Resume"
  },
  "home": {
    "title": "Welcome to my website!",
    "subtitle": "I'm an Automated Test Analyst.",
    "paragraph": "Hello, I'm Rafael, and it's a pleasure to welcome you to my web resume. Feel free to explore my skills and experiences. If you have any questions or need further information, I'm here to help. Let's get started!",
    "accessNetworks": "Access my networks"
  },
  "aboutMe": {
    "title": "About Me",
    "description": [
      "I'm Rafael, a Senior Quality Test Analyst. With over 10 years of experience, I specialize in functional testing, automation, and project management. Committed to excellence, I believe that quality is the foundation of any successful project.",
      "My professional journey has allowed me to work across various sectors and challenging projects. This diversity has given me a much better understanding of software development and the ability to adapt easily to different scenarios.",
      "Beyond my work, I'm a technology enthusiast who is always seeking continuous learning and knowledge sharing. I believe in collaboration as a catalyst for success and am committed to contributing to the growth of the quality testing community."
    ]
  },
  "resume": {
    "subtitle": "Senior Automated Test Analyst",
    "education": [
      {
        "title": "Education",
        "description": [
          "POST-GRADUATION: Software Engineering with emphasis on Quality and Software Testing - Vincit College Start DEC-2022, expected completion DEC-2023.",
          "UNDERGRADUATE - Systems Analysis and Development - Anhanguera College Start in the first semester of 2019 night period, expected completion in the second semester of 2021"
        ]
      },
      {
        "title": "Courses and Certifications",
        "description": [
          "CTFL Certificate - Certified Tester Foundation Level - BSTQB."
        ]
      },
      {
        "title": "Skills",
        "description": [
          "End-to-end automation with Java/Python and Selenium.",
          "Also experienced with Javascript/Typescript and Cypress.",
          "Solid knowledge of SQL queries.",
          "Backend automation (API) with Python and Behave (Python's Cucumber).",
          "Testing and automations with REST requests, using Postman.",
          "Writing and developing test scenarios using Gherkin (BDD), with Cucumber/Behave. Load and Performance testing with JMeter."
        ]
      }
    ],
    "experiencies": {
      "title": "Experiences",
      "items": [
        {
          "title": "AUTOMATED TEST ANALYST",
          "company": "Capgemini - Lisbon - Portugal",
          "startDate": "JAN/2023",
          "endDate": "PRESENT",
          "duration": null,
          "description": "Working for Capgemini at the Government Computing Institute of Portugal. I work in the temporary impediments sector for work, doing test automation with Java and a company's own framework based on Selenium. This project is already underway with many tests not working. My entry was to update existing tests and create new ones for new deliveries. We work with Kanban. Always developing tests with dynamic data from the Oracle database, using SQL queries. Writing scenarios with Gherkin, creating feature files."
        },
        {
          "title": "AUTOMATED TEST ANALYST",
          "company": "Dialog Information Technology",
          "startDate": "JAN/2022",
          "endDate": "JAN/2023",
          "duration": "1 year and 1 month",
          "description": "I am a consultant to start an automation project at the company. Internal communication product for HR, with messages among employees, management, communications, etc. I started an automation project from scratch with Cypress/JavaScript, from project implementation phase, automation architecture, repository configuration, etc. Responsible for the entire test development process, from writing scenarios (Gherkin - BDD), documentation, and automation of these scenarios. If bugs are found, they are reported on Monday. This automation started on already completed products, being gradually implemented in each sprint, testing new products/features. Training of other team members for the implementation of new scenarios and tests in the automation project. About 450,000 app/system users."
        },
        {
          "title": "AUTOMATED TEST ANALYST",
          "company": "Assertiva Information Technology",
          "startDate": "MAR/2020",
          "endDate": "JAN/2022",
          "duration": "1 year and 10 months",
          "description": "Responsible for the quality team of the developed product. Ensuring maximum coverage of functional and non-functional tests, manual and automated, writing test cases following the BDD process, performance testing, backend automation using Python and Behave and frontend using Ruby and Capybara/Cucumber and Python/Behave with Selenium. Manual tests of Rest API using Postman, making requests to endpoints (provided by devs via Swagger), test documentation and reporting any bugs in tools like Trello and/or Jira. Currently (from DEC/20) considered one of the QA leaders, responsible for code review of other QAs, approving or suggesting improvements before merging into the Master project. Also responsible for training new QAs who joined the company with less experience and familiarity with automation."
        },
        {
          "title": "AUTOMATED TEST ANALYST",
          "company": "Cflex Flexible Computing and Rail MP",
          "startDate": "SEP/2015",
          "endDate": "FEB/2020",
          "duration": "4 years and 5 months",
          "description": "Perform functionality tests of the software developed by the company. Create, write, and execute test cases. Report bugs found in the Atlassian JIRA system. Review and give my opinion on technical specification stories (User Stories) written by the Business Analyst. Develop and execute test cases that may generate failures/bugs in the system. Prepare documentation of testing processes and/or software developed by the company."
        }
      ]
    }
  }
}